;; -*- no-byte-compile: t; -*-
;;; .doom.d/packages.el
(package! shell-pop)
(package! doom-themes
  :recipe (:host github :repo "t-e-r-m/emacs-doom-themes" :branch "theme-fixes"))
(package! gotham-theme)
(package! moe-theme)
(package! soothe-theme)
(package! noctilux-theme)
(package! darktooth-theme)
(package! danneskjold-theme)
(package! faff-theme)
(package! darkokai-theme)
(package! srcery-theme)
(package! naquadah-theme)
(package! eink-theme)
(package! paper-theme)
(package! brutalist-theme)
(package! paganini-theme)
(package! flatland-black-theme)
(package! firecode-theme)
(package! mustang-theme)
(package! monokai-alt-theme)
(package! monokai-pro-theme)
(package! minimal-theme)
(package! phoenix-dark-pink-theme)
(package! jazz-theme)
(package! tao-theme)
(package! nimbus-theme)
(package! rebecca-theme)
(package! badwolf-theme)
(package! plan9-theme)
(package! spacegray-theme)
(package! soothe-theme)
(package! seti-theme)
(package! gruber-darker-theme)
(package! sublime-themes)
(package! green-is-the-new-black-theme)
(package! seoul256-theme)
(package! color-theme-sanityinc-tomorrow)
(package! lenlen-theme)
(package! sunburn-theme)
(package! anti-zenburn-theme)
(package! zenburn-theme)
(package! labburn-theme)
(package! eww)
(package! fzf)
(package! zone-nyan)
(package! nyan-mode)
(package! hide-comnt)
(package! showkey)
(package! elfeed)
(package! lorem-ipsum)
(package! coffee-mode)
(package! zoom)
(package! alarm-clock)
(package! nov)
(package! speed-type)
(package! tiny)
(package! powerthesaurus)
(package! define-word)
(package! 0x0)
(package! define-it)
(package! mixed-pitch)
(package! bison-mode)
(package! darkroom)
(package! olivetti)
(package! flames-of-freedom)
(package! 0xc)
(package! colorless-themes)
(package! punpun-theme)
(package! fireplace)
(package! leuven-theme)
(package! subatomic-theme)
(package! almost-mono-themes)
(package! centered-cursor-mode)
(package! live-preview)
(package! transpose-frame)
(package! vimrc-mode)
(package! wgrep)
(package! rg)
(package! git-link)
(package! pamparam)
(package! vdiff)
(package! mini-frame)
(package! fish-mode)
(package! org-drill)
(package! evil-matchit)
(package! explain-pause-mode :disable t)
(package! hoon-mode :recipe (:host github :repo "urbit/hoon-mode.el"))
(package! focus)
(package! calibredb)
(package! outshine)
(package! annotate)
(package! langtool :disable t)
(package! lexic :recipe (:host github :repo "tecosaur/lexic"))
(package! key-chord)
(package! pdf-tools :recipe (:host github :repo "flatwhatson/pdf-tools" :branch "fix-macros"))
(package! rainbow-blocks)
(package! org-bullets :recipe (:host github :repo "Kaligule/org-bullets"))
(package! imenu-list)
(package! flimenu)
(package! keycast)
(package! bicycle)
(package! outline-minor-faces)
(package! backline)
(package! dired-du)
(package! scratch-pop)
(package! unkillable-scratch)
(package! dired-narrow)
(package! dired-collapse)
(package! pandoc-mode)
(package! org-ql)
(package! dired-quick-sort)
(package! moody)
(package! project :pin nil)
(package! syntactic-close)
(package! org-id-cleanup)
(package! abridge-diff)
(package! deadgrep)
(package! inkpot-theme)
(package! sorcery-theme
  :recipe (:host github :repo "t-e-r-m/emacs-theme-sorcery" :branch "misc-210101"))
(package! dtk)
(package! organic-green-theme)
(package! spatial-navigate)
(package! json-mode)
(package! kaolin-themes)
(package! org-transclusion
  :recipe (:host github :repo "nobiot/org-transclusion" :branch "main"))
(package! ztree)
(package! dired-posframe)
